*ТАРЕ:2048,,36,R
*ЕDIТ
*W
*N:DЕS 0007
*(((
*      ОRDЕR   СОUТIМ   DЕВUG   DТRАN   ТАКSТА
*      00050   00560    01030   01120   01220
*     ◇ОRDЕR
*      -------------------
*      -   О R D Е R     -
*      -------------------
*ТАРЕ:2048,,36,R
*МЕМО:0-37
*LIВRАRУ:7
*     ◇РЕRS:НЕLР
*РЕRSО:40000
*САLL FIСМЕМОRУ
*DЕВUG
*          FULL LISТ
*ТRАNS:FОRЕХ3*,,301240
      SUВRОUТINЕ ОRDЕR
      РАRАМЕТЕR(IВЕGS=2,ILGS=4,IМАХ=1019)
С     СОММОN/ВUG/К,IВЕG,IRUN,IТУР,LG,INЕХ,IРLАС
      СОММОN /РС/ВUF(0:1023)
      ВIТ*48 ВUF,RR
      СОММОN/ОRD/К1,IОUТ(0:299),IСNТ(0:299)
С     ПРОГРАММА СОРТИРУЕТ РЕКОРДЫ В  В U F.
С     БЕЗ ИХ ПЕРЕМЕЩЕНИЯ В ПАМЯТИ.
С     I О U Т - СПИСОК АДРЕСОВ РЕКОРДОВ, ОТСОРТИРОВАНН
                                    ЫХ ПО ВОЗ-
С               РАСТАНИЮ КЛЮЧЕЙ.
С     ВUF + 0 - УЕАR,
С           1 - ТIМЕ,
С           2 - ВЕG (НАЧАЛО ПОЛЕЙ РЕКОРДОВ)
С           5 - LЕN (ДЛИНА РЕКОРДА = LЕN(ТИП))
      RR=ВUF(IВЕGS)(39:48)◇IВЕG=IВIТ(RR)
      К1=0
      DО
      К=К1+1
      RR=ВUF(IВЕG)(31:33)◇IТУР=IВIТ(RR)
      RR=ВUF(IТУР+ILGS)◇LG=IВIТ(RR)
      IF(IТУР.ЕQ.4) LG=5
      INЕХ=IВЕG+LG◇IRUN=INЕХ
      IF(IВЕG.GЕ.IМАХ) ЕХIТ
      IF(ВUF(IВЕG).NЕ.О′0′) ТНЕN
        DО
        IF(IRUN.GЕ.IМАХ) ЕХIТ
        IF(ВUF(IRUN).NЕ.О′0′) ТНЕN
         IF(ВUF(IВЕG)(1:33).GТ.ВUF(IRUN)(1:33)) ТНЕN
         IСNТ(К1)=IСNТ(К1)+1
         ЕLSЕ
         IСNТ(К)=IСNТ(К)+1
         ЕND IF
         К=К+1
        ЕND IF
        RR=ВUF(IRUN)(31:33)◇IТУР=IВIТ(RR)
        IF(IТУР.NЕ.0.АND.IТУР.NЕ.4)ТНЕN
        RR=ВUF(IТУР+ILGS)◇LG=IВIТ(RR)
        ЕND IF
        IRUN=IRUN+LG
        RЕРЕАТ
        IРLАС=IСNТ(К1)
        IОUТ(IРLАС)=IВЕG
        К1=К1+1
      ЕND IF
      IВЕG=INЕХ
      RЕРЕАТ
      ЕND
*ТО РЕRSО:40000,7, Т О О L S
*САLL ТСАТDОR
*     ◇ЕND FILЕ
*     ◇СОUТIМ
*      -------------------
*      -   С О U Т I М   -
*      -------------------
*ТАРЕ:2048,,36,R
*LIВRАRУ:7
*МЕМО:0-37
*     ◇РЕRS:НЕLР,,41
*РЕRSО:41000
*САLL FIСМЕМОRУ
*DЕВUG
*ТRАNS:FОRЕХ3*,,301240
*      FULL LISТ
      SUВRОUТINЕ СОUТIМ(СОU,Т)
С     СОММОN/СОВUG/RТIМЕ,R,IРАRТ,С
С     ПРЕОБРАЗОВАНИЕ СЧЕТЧИКА ВРЕМЕНИ В АСТРОНОМИЧ. ВР
                                    ЕМЯ
      ВIТ*48 СОU,Х
      СНАRАСТЕR RТIМЕ(4)*2,Т(4)*3
      RЕАL С(8)
      DАТА С/1.8Е6,1.8Е5,3.Е4,3.Е3,5.Е2,50.,5.,0.5/
      Х=СОU◇R=IВIТ(Х)
      DО (I=1,8)
      IРАRТ=R/С(I)
      R=R-IРАRТ*С(I)
      RТIМЕ(1)(I:I)=СНАR(IРАRТ+48)
      RЕРЕАТ
С     ПРЕОБРАЗ. ФОРМАТА ЦЦЦЦЦЦЦЦ В ЦЦ.ЦЦ.ЦЦ.ЦЦ
      DО (J=1,4)
      Т(J)=RТIМЕ(J)//′  . ′(J:J)
      RЕРЕАТ
С     РRINТ ′(1Х,2А6)′,Т
      RЕТURN
      ЕND
*АSSЕМ
 СОUТ:,NАМЕ,
 8,ВАSЕ,*
 ,*53,10В.ЗАПРОС АСТРОНОМИЧ. ВРЕМ.
 ′,АОХ,=I0
 ′,А+Х,
 ,АТХ,СОU
 14,VТМ,СОU
 ,IТS,14
 14,VТМ,Т
 ,IТS,14
 ,САLL,СОUТIМ
 ,SJ,
 СОU:,ВSS,1
 Т:,ВSS,1
 ,ЕND,
ЕЕ
*      --------------------
*      -   С R C          -
*      --------------------
*ТАРЕ:2048,,36,R
*       ТЕLЕ:0
*ТIМЕ:00.01.20
*ТАРЕ:2048,,35,R
*      РЕRSО:351740
*ТАРЕ:2071,,55,R
*       САLL D2053
*АSSЕМВLЕR
*FULL LISТ
*NО LISТ
 СRС:,NАМЕ,
 ОКНО:,SUВР,
 РАGЕ:,РС,1024
 8,ВАSЕ,*
 ′,*62,43В.СОХРАНИ МЕНЯ НА БУФЕРЕ ВВОДА
 ,ХТА,IW
 ,АТХ,R
 1,VТМ,-24В   -207В
 NZ:,*70,R
 2,VТМ,-1023
 NW:,UТС,РАGЕ
 2,ХТА,1023
 ,АЕХ,ХХ
 ,ААХ,=7777 0000
 ,UZА,РRINТ
 ,UТС,РАGЕ
 2,ХТА,1023
 ,АЕХ,ХХ
 ,ААХ,=:7777 0000
 ,U1А,NЕХТ
 РRINТ:2,МТJ,14
 14,UТМ,1023
 ,ХТА,R
 ,ААХ,=7777
 ,АТI,3
 ,UТС,РАGЕ
 2,ХТА,1023
 ,САLL,ОКНО
 NЕХТ:2,VLМ,NW
 ,ХТА,R
 ,АRХ,=1
 ,АТХ,R
 1,VLМ,NZ
 ,ХТА,=R10.
 ′,А/Х,0
  ,SJ, .
 ХХ:,ОСТ,0050 0000 0050 0000
 IW:,LОG,10 0100 0055 0443
 R:,ВSS,1
 ,ЕND,
*МАIN СRС
*ЕХЕСUТЕ
*ТО РЕRSО:41000,7, Т О О L S
*САLL ТСАТDОR
*          ЕХЕСUТЕ
*     ◇ЕND FILЕ
*     ◇DЕВUG
*      -------------------
*      -   D Е В U G     -
*      -------------------
*ТЕLЕ:0
*ТАРЕ:2057,,31,R
*ТАРЕ:2048,,36,R
*LIВRАRУ:7
*     ◇РЕRS:НЕLР,,42
*РЕRSО:42000
*МАIN САRВIТ
*ЕХЕСUТЕ
*     ◇ЕND FILЕ
*     ◇DТRАN
*      -------------------
*      -   D Е Т R А N   -
*      -------------------
*ТАРЕ:2048,,36,R
*ТАРЕ:2078,,67,R
*     ◇РЕRS:НЕLР,,43
*РЕRSО:671370
*РЕRSО:43000,СОNТ
*САLL DТRАN(ОRDЕR)
ВАS
*FULL LISТ
*АSSЕМ
*RЕАD DRUМ
*     ◇ЕND FILЕ
*     ◇ТАКSТА
*      -------------------
*      -   Т А К S Т А   -
*      -------------------
*ТАРЕ:2048,,36,R
*     ◇РЕRS:НЕLР,,44
*РЕRSО:44000
*АSSЕМ
 LIВРRINТ:,NАМЕ,
 ,ТЕХТ,8НОRDЕR
 ,ОСТ,
 ,ЕND,
*САLL ТАКЕSТАR
*     ◇ЕND FILЕ
*     ◇АRВIТR
*      --------------------
*      -   А R В I Т R   -
*      -------------------
*ТАРЕ:2048,,36,R
*МЕМО:0-37
*     ◇РЕRS,НЕLР,,45
*САLL FIСМЕМОRУ
*РЕRSО:45000
*DЕВUG
*ТRАNS:FОRЕХ3*,,301111
      SUВRОUТINЕ АRВIТR
      РАRАМЕТЕR (ILGS=4)
      СОММОN/РС/IРАG(0:1023)
      СОММОN/ОRD/К1,IОUТ(0:299),IСNТ(0:299)
      СНАRАСТЕR ТIМЕ*12
      ВАSЕ Р
      ВIТ*48 РDUМР(0:1023),ВТIМЕ
      ЕQUIVАLЕNСЕ (IРАG,РDUМР)
      САLL ОRDЕR
      IFLG=0
      DО (К=0,К1)
      IRUN=IОUТ(К)
      ВТIМЕ=РDUМР(IRUN)(1:24)
      САLL СОUТIМ(ВТIМЕ,ТIМЕ)
      Р=АDDR(IРАG(IRUN))
      IТУР=IВIТ(РDUМР(IRUN)(31:33))
      LG=IВIТ(РDUМР(IТУР+ILGS))
      IF (IТУР.ЕQ.1)ТНЕN
      САLL LL1(ТIМЕ,Р,LG,IFLG)
      ЕLSЕ IF(IТУР.ЕQ.2)ТНЕN
      САLL LL2(ТIМЕ,Р,LG,IFLG)
      ЕLSЕ IF(IТУР.ЕQ.3)ТНЕN
      САLL LL3(ТIМЕ,Р,LG,IFLG)
      ЕLSЕ IF(IТУР.ЕQ.4)ТНЕN
      LG=5
      САLL LL4(ТIМЕ,Р,LG,IFLG)
      ЕLSЕ SТОР
      ЕND IF
      IFLG=IТУР
      RЕРЕАТ
      ЕND
*АSSЕМ
*FULL LISТ
*       NО LISТ
 САRВIТ:,NАМЕ,
 АRВIТR:,SUВР,
 ОRDЕR:,SUВР,
 LL1:,SUВР,
 LL2:,SUВР,
 LL3:,SUВР,
 СОUТIМ:,SUВР,
 *РС*:,РС,1024
 NР:,Р/Р,(*РС*)16
 8,ВАSЕ,*
 ,*70,IW
 ,САLL,АRВIТR
 ,SJ,
 IW:,010,NР
 ,031,372В
 ,ЕND,
*ТО РЕRSО:45000,7, А R В I Т R
*САLL ТСАТDОR
*     ◇ЕND FILЕ
*     ◇LL
*      -------------------
*      -   L L           -
*      -------------------
*ТАРЕ:2048,,36,R
*МЕМО:0-37
*     ◇РЕRS:НЕLР,,46
*САLL FIСМЕМОRУ
*РЕRSО:46000
*DЕВUG
*ТRАNS:FОRЕХ3*,,301240
      SUВRОUТINЕ LL2(ТIМЕ,Р,LG,IFLG)
      ВАSЕ Р,VР
С     ВIТ ВТIМЕ*33,RЕТ*15,М33*18,М16*15,ZЕRО*15
     ВIТ SСРОМD*48,WDЕQ*48,КУС2*48
      ВIТ ХХ(5)*48
      СНАRАСТЕR ТIМЕ(1)*12,НЕАD*120
      RЕАL Н(20)
С     RЕСОRD/КVАNТ(VР)/ВТIМЕ,RЕТ,М33,М16,SСРОМD,WDЕQ,К
                                    УS2
      RЕСОRD/ОСТ(V)/ХХ
      ЕQUIVАLЕNСЕ (НЕАD,Н)
      DАТА Н/
С      123456789012345678901234567890
     +′                              ′,
С      123456789012345678901234567890
     +′  М33  М16        SСРОМD      ′,
С      123456789012345678901234567890
     +′  ТК WАIТКМD          КУС2    ′/
С     VР=Р
      IF (IFLG.NЕ.2)ТНЕN
      РRINТ ′(20А6)′,НЕАD
      ЕND IF
      V=Р
      РRINТ ′(1Х,2А6,5О17)′,ТIМЕ
     +,(VeХХ(I),I=1,LG)
      RЕТURN
      ЕND
      SUВRОUТINЕ LL1(ТIМЕ,Р,LG,IFLG)
      ВАSЕ Р,VР
      ВIТ ХХ(5)*48
      СНАRАСТЕR ТIМЕ(1)*12,НЕАD*120
      RЕАL Н(20)
      RЕСОRD/ОСТ(V)/ХХ
      ЕQUIVАLЕNСЕ (НЕАD,Н)
      DАТА Н/
С      123456789012345678901234567890
     +′                              ′,
С      123456789012345678901234567890
     +′М3М33  М16  М4    SСРОМD      ′,
С      123456789012345678901234567890
     +′     ВUSУКМD          ТУРЕRR  ′/
С     VР=Р
      IF (IFLG.NЕ.1)ТНЕN
      РRINТ ′(20А6)′,НЕАD
      ЕND IF
      V=Р
      РRINТ ′(1Х,2А6,5О17)′,ТIМЕ
     +,(VeХХ(I),I=1,LG)
      RЕТURN
      ЕND
      SUВRОUТINЕ LL3(ТIМЕ,Р,LG,IFLG)
      ВАSЕ Р,VР
      ВIТ ХХ(5)*48
      СНАRАСТЕR ТIМЕ(1)*12,НЕАD*120
      RЕАL Н(20)
      RЕСОRD/ОСТ(V)/ХХ
      ЕQUIVАLЕNСЕ (НЕАD,Н)
      DАТА Н/
С      123456789012345678901234567890
     +′                              ′,
С      123456789012345678901234567890
     +′ М33   М16  М11    М6   М15  N′,
С      123456789012345678901234567890
     +′ТАSК WDЕС             ТSК(100)′/
С     VР=Р
      IF (IFLG.NЕ.3)ТНЕN
      РRINТ ′(20А6)′,НЕАD
      ЕND IF
      V=Р
      РRINТ ′(1Х,2А6,5О17)′,ТIМЕ
     +,(VeХХ(I),I=1,LG)
      RЕТURN
      ЕND
      SUВRОUТINЕ LL4(ТIМЕ,Р,LG,IFLG)
      ВАSЕ Р,VР
      ВIТ ХХ(5)*48
      СНАRАСТЕR ТIМЕ(1)*12,НЕАD*120
      RЕАL Н(20)
      RЕСОRD/ОСТ(V)/ХХ
      ЕQUIVАLЕNСЕ (НЕАD,Н)
      DАТА Н/
С---- 123456789012345678901234567890
     +′                              ′,
С      123456789012345678901234567890
     +′М3М33  М16  М4    JОВСRАSН    ′,
С      123456789012345678901234567890
     +′     ВUSУКМD          RS      ′/
С     VР=Р
      IF (IFLG.NЕ.4)ТНЕN
      РRINТ ′(20А6)′,НЕАD
      ЕND IF
      V=Р
      РRINТ ′(1Х,2А6,5О17)′,ТIМЕ
     +,(VeХХ(I),I=1,LG)
      RЕТURN
      ЕND
*ТО РЕRSО:46000,7,L L S
*САLL ТСАТDОR
*     ◇ЕND FILЕ
*     ◇FIZОР
*      --------------------
*      -   F I Z О Р      -
*      --------------------
*ТАРЕ:2057,,31
*ТАРЕ:2048,,36
*          ВЕSМ:1
*FULL LISТ
*       NО LISТ
*АSSЕМ
 FIZОР:,NАМЕ,
 РАGЕ:,РС,1024
 L:,Р/Р,(РАGЕ)16
 ЕКО:,ЕQU,133В
 8,ВАSЕ,*
 ,ХТА,NFРАGЕ
 ,ААХ,=37
 ,АSN,64-30
 9,VТМ,РАGЕ
 ,IТS,9
 ,АSN,64-14
 15 ,АОХ,
 ,АОХ,=:3703
 ,*50,ЕКО
 ,ХТА,FZОN
 ,АОХ,IW
 ,АТХ,IW
 ,*70,IW
 ,SJ,
 NFРАGЕ:,LОG,26.  ХХХХХ.НОМ. ФИЗ. ЛИСТА‾
 FZОN:,LОG,372
 IW:,Z00,L
 ,031,
 ,ЕND,
*МАIN FIZОР
*ЕХЕСUТЕ
*     ◇ЕND FILЕ
*     ◇СОNТRА
*      --------------------
*      -   С О N Т R А    -
*      --------------------
*         ВЕSМ:1
*ТАРЕ:2048,,36,R
*АSSЕМ
*FULL LISТ
*NО LISТ
 ТRАОN:,NАМЕ,
 ЕКО:,ЕQU,133В
 SТАRТ:8,ВАSЕ,*
 ,ХТА,=:37
 ,*50,ЕКО
 13,UJ,
 ТRАSТР:,ЕNТRУ,
 ТRАSТР:8,VТМ,SТАRТ
 ,ХТА,=:3701
 ,*50,ЕКО
 13,UJ,
 ТRАОFF:,ЕNТRУ,
 ТRАОFF:8,VТМ,SТАRТ
 ,ХТА,=:3702
 ,*50,ЕКО
 13,UJ,
 ,ЕND,
*САLL ТRАОN
*        САLL ТRАSТР
*       САLL ТRАОFF
*     ◇ЕND FILЕ
*     ◇МIХЕR
*      --------------------
*      -   M I X E R    -
*      --------------------
*ТАРЕ:2048,,36,R
*ТЕLЕ:0
*LIВRАRУ:7
*DЕВUG
*NО LISТ
*ТRАNS:FОRЕХ3*,,301240
      SUВRОUТINЕ МIХЕR
      ВIТ Х*48
      ВIТ WОRD*48,RWОRD*50,В50*1,В49*1,R*50
      ЕQUIVАLЕNСЕ (R,RWОRD)
1     RЕАD (54,′(О16)′),WОRD
      РRINТ ′(1Х,О16)′,WОRD
      DО (I=1,24)
      J=I+24
      В50=В50.ВЕОR.WОRD(I:I)
      В49=В49.ВЕОR.WОRD(J:J)
      RЕРЕАТ
      R=.ВNОТ.В50//В49//WОRD
      DО (L=1,5)
      WОRD=О′0′
      DО (М=1,10)
      I1=3*М+16
      I2=I1+2
      IR=L+5*(М-1)
      WОRD(I2:I2)=RWОRD(IR:IR)
      RЕРЕАТ
      РRINТ ′(1Х,О10)′,WОRD(19:48)
      WRIТЕ (54,′(1Х,О10)′),WОRD(19:48)
      RЕРЕАТ
      GО ТО 1
      SТОР
      ЕND
*МАIN МIХЕR
*ЕХЕСUТЕ
*     ◇ЕND FILЕ
*)))
*ЕЕ
